results/172.31.26.20:5000/2021-02-26-14-58-48/summary.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.31.26.20 (be patient)...INFO: POST header == 
---
POST /api/nlp/v2/intent?userid=5f427f94a5c7f67b3985cc8d HTTP/1.0
Content-length: 31
Content-type: application/json
authorization: YaMtrXkKMTvxB8E4L8uW77YMcxSSL4KQ
Host: 172.31.26.20:5000
User-Agent: ApacheBench/2.3
Accept: */*


---
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 14:58:48 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 14:58:48 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 14:58:49 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 14:58:49 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 14:58:49 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 14:58:49 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 14:58:49 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 14:58:49 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 14:58:49 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 14:58:49 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 14:58:49 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 14:58:49 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 14:58:49 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 14:58:49 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 14:58:49 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 14:58:49 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 14:58:49 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 14:58:49 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 14:58:49 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 14:58:49 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 14:58:49 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 14:58:49 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 14:58:49 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 14:58:49 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 14:58:49 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
..done


Server Software:        gunicorn/20.0.4
Server Hostname:        172.31.26.20
Server Port:            5000

Document Path:          /api/nlp/v2/intent?userid=5f427f94a5c7f67b3985cc8d
Document Length:        39 bytes

Concurrency Level:      25
Time taken for tests:   0.875 seconds
Complete requests:      25
Failed requests:        0
Total transferred:      5575 bytes
Total body sent:        6675
HTML transferred:       975 bytes
Requests per second:    28.58 [#/sec] (mean)
Time per request:       874.797 [ms] (mean)
Time per request:       34.992 [ms] (mean, across all concurrent requests)
Transfer rate:          6.22 [Kbytes/sec] received
                        7.45 kb/s sent
                        13.68 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1    1   0.2      1       1
Processing:   215  552 220.8    573     874
Waiting:      215  551 220.7    573     874
Total:        216  552 220.8    574     874

Percentage of the requests served within a certain time (ms)
  50%    564
  66%    697
  75%    753
  80%    796
  90%    857
  95%    862
  98%    874
  99%    874
 100%    874 (longest request)